/*============================================================================
    File Name     : FOC_Loop.c
    Description   : FOC循环模块 - 包含FOC循环相关的函数
    Author        : ZHOUHENG
    Date          : 2025-11-13
    ----------------------------------------------------------------------       
    开环 给定DQ参考电压
        1、先搭建开环控制流程，检查 SVPWM 输出是否正常
    电流环
        电流采样，位置反馈，坐标变换，发波，PID控制
    速度环 
*=============================================================================
*/

#include "FOC_Loop.h"