// TODO :确定系统中所有需要归一化(标幺)的物理量及其预期的最大值。
/* ======================================================================
    ## 第一套方案 基于额定值的归一化
    ### 在ABC坐标下，
    额定相电压: Vb3 = ;
    额定相电流: Ib3 = ;
    则功率基值：Pb =3*Vb3*Ib3;

    ### 在DQ坐标下，
    额定相电压: Vb = sqrt(2)*Vb3;
    额定相电流: Ib = sqrt(2)*Ib3;
    则功率基值：Pb = 3*Vb3*Ib3 = 1.5*Vb*Ib;

    ## 参数说明
    Pb : 功率基值
    Tb : 转矩基值
    Ib : 电流基值
    P  : 电机极数
    Pn : P/2 极对数
    lamaf:转子磁链
    Rs : 定子每相电阻
    Lq : q轴 定子每相电感
    Ld : d轴 定子每相电感
    B  : 粘滞摩擦系数
    J  : 转动惯量

    RPM : 电机转速（转/分）
    ws = (2*pi*RPM/60)*Pn  // 电角速度（rad/s）

    ro = Lq/Ld; //凸极比

    ### 基值
    Vb = Pb / (3*Ib)    // 电压基值
    Zb = Vb / Ib        // 阻抗基值
    lamb = lamaf        // 磁链基值
    Lb = lamb / Ib      // 电感基值
    wb = Vb / lamb      // 电角速度基值

    Rsn = Rs / Zb; // 归一化后的定子每相电阻
    Lqn = Lq / Lb; // 归一化后的q轴定子每相电感
    Ldn = Ld / Lb; // 归一化后的d轴定子每相电感
    Bn  = B*wb^2/(Pb*(Pn)^2); // 归一化后的粘滞摩擦系数
    H  = J*wb^2/(2*Pb*(Pn)^2); // 归一化后的转动惯量(惯性常数)
    lamafn = lamaf/lamb; // 归一化后的转子磁链

    ## 第二套方案 直接使用硬件参数为归一化基值

    ### 基值

    电压基值: V_base = V_dc/sqrt(3);            // 在SVPWM情况下 逆变器提供的最大相电压 = 直流母线电压/√3
    电流基值: I_base = ISenseMax;               // 逆变器的电流感测电路可测量的最大电流
    转数基值: w_base = (2*pi*RPM/60)*Pn;        // 电机转速(转/分)转换为电角速度(rad/s)
    转矩基值: T_base = (3/2)*Pn*lamaf*I_base;   // 此转矩是根据基电流通过数学计算推断,lamaf为PMSM的永磁磁链,Pn极对数
    功率基值: P_base = (3/2)*I_base*V_base;     // 由基电压和基电流推断的功率
    阻抗基值: Z_base = V_base / I_base;         // 由基电压和基电流推断的阻抗，同方案一
    电感基值: L_base = lamb / I_base;           // 电感基值，同方案一

    * =================================================================== */

