// TODO :确定系统中所有需要归一化的物理量及其预期的最大值。
/* ======================================================================
    ## 在ABC坐标下，
    额定相电压: Vb3 = ;
    额定相电流: Ib3 = ;
    则功率基值：Pb =3*Vb3*Ib3;

    ## 在DQ坐标下，
    额定相电压: Vb = sqrt(2)*Vb3;
    额定相电流: Ib = sqrt(2)*Ib3;
    则功率基值：Pb = 3*Vb3*Ib3 = 1.5*Vb*Ib;

    ## 参数说明
    Pb : 功率基值
    Tb : 转矩基值
    Ib : 电流基值
    P  : 电机极数
    Pn : = P/2 极对数
    lamaf:转子磁链
    Rs : 定子每相电阻
    Lq : q轴 定子每相电感
    Ld : d轴 定子每相电感
    B  : 粘滞摩擦系数
    J  : 转动惯量

    RPM : 电机转速（转/分）
    ws = (2*pi*RPM/60)*P/2  // 电角速度（rad/s）

    ro = Lq/Ld; //凸极比

    ## 基值
    Vb = Pb / (3*Ib)    // 电压基值
    Zb = Vb / Ib        // 阻抗基值
    lamb = lamaf        // 磁链基值
    Lb = lamb / Ib      // 电感基值
    wb = Vb / lamb      // 电角速度基值

    Rsn = Rs / Zb; // 归一化后的定子每相电阻
    Lqn = Lq / Lb; // 归一化后的q轴定子每相电感
    Ldn = Ld / Lb; // 归一化后的d轴定子每相电感
    Bn  = B*wb^2/(Pb*(Pn)^2); // 归一化后的粘滞摩擦系数
    Jn  = J*wb^2/(2*Pb*(Pn)^2); // 归一化后的转动惯量
    lamafn = lamaf/lamb; // 归一化后的转子磁链

    * =================================================================== */

